goekesmi/triton-cloud-images/ansible/roles/smartos_guest/files/alpine-3/usr/share/man/man8/mdata-delete.8
.\" Copyright (c) 2013, Joyent, Inc.
.\" Copyright 2023 MNX Cloud, Inc.
.\" See LICENSE file for copyright and license details.

.TH "MDATA-DELETE" "8" "May 2023" "TritonDataCenter" "Metadata Commands"

.SH "NAME"
\fBmdata-delete\fR \-\- Delete a metadata key-value pair\.

.SH "SYNOPSIS"
.
.nf
\fB/usr/sbin/mdata-delete\fR \fIkeyname\fR
.fi

.SH "DESCRIPTION"
.sp
.LP
The \fBmdata-delete\fR command allows the user (or a script) to modify the
metadata for a guest instance running in a \fITritonDataCenter (TDC)\fR cloud.
Metadata values are generally set programmatically via \fICloudAPI\fR, or
during interactive provisioning via a Web Portal.  They may also be set from
within the instance with the \fBmdata-put\fR command.
.sp
.LP
The key-value pair for \fIkeyname\fR will be removed permanently from the
metadata stored for this guest instance.  Deletion of a key which did not
exist is not considered an error.
.sp
.LP
If the metadata service is unavailable at the time of the request, this command
will block waiting for it to become available.  Non-transient failures will
cause the program to exit with a non-zero status.  Depending on the nature of
the error, some diagnostic output may be printed to \fBstderr\fR.

.SH "EXIT STATUS"
.sp
.LP
The following exit values are returned:

.sp
.ne 2
.na
\fB0\fR
.ad
.RS 5n
Successful completion.
.sp
The key-value pair named \fIkeyname\fR was removed from the instance metadata,
or did not initially exist.
.RE

.sp
.ne 2
.na
\fB2\fR
.ad
.RS 5n
An error occurred.
.sp
An unexpected error condition occurred, which is believed to be a
non-transient condition.  Retrying the request is not expected to
resolve the error condition; either a software bug or misconfiguration
exists.
.RE

.sp
.ne 2
.na
\fB3\fR
.ad
.RS 5n
A usage error occurred.
.sp
Malformed arguments were passed to the program.  Check the usage instructions
to ensure valid arguments are supplied.
.RE

.SH "SEE ALSO"
.sp
.LP
\fBmdata-get\fR(8), \fBmdata-list\fR(8), \fBmdata-put\fR(8)
